<?php

require __DIR__ . '/../etc/bootstrap.php';

//確認是否有修改表單資料
if (!empty($_POST)) {

    // =============================================================================
    // = 處理送來的表單資料
    // =============================================================================

    $uId = $_POST["id"] ?? "";

    /* =============================================================================
     * = 刪除使用者資料
     * =============================================================================
    **/

    $deleteResult = deleteUser($conn, $uId);

    // 跳轉並將結果帶回修改頁面。
    header("Location:../usersTable.php?delete={$uId}&result={$deleteResult}");
    die();
}

header("Location:../stickerPage.php");
